tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mvndaemon/mvnd"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Bare libuv bindings for lua
brew "luv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# JVM-based programming language
brew "scala"
# JVM-based programming language
brew "scala@2.13"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Simple GTD-style task management for the command-line
brew "ultralist"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Zeebe CLI client
brew "zbctl"
# UNIX shell (command interpreter)
brew "zsh"
# Maven Daemon
brew "mvndaemon/mvnd/mvnd"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Apple TV Aerial screensaver
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# Workflow and Decision Automation Platform
cask "camunda-modeler"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Launcher for *Epic Games* games
cask "epic-games"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Free and open-source image editor
cask "gimp"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# End-to-end encryption software
cask "keybase"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cross-platform video editor
cask "openshot-video-editor"
# Monitors computer mic and webcam
cask "oversight"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Client for Old School RuneScape
cask "runelite"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Backup, recovery and cloning software
cask "superduper"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Stopwatch, alarm clock, and clock utility
cask "timer"
# To-do list
cask "todoist"
# Pomodoro desktop timer
cask "tomighty"
# Mutes your keyboard while you type
cask "unclack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
