tap "homebrew/bundle"
tap "mvndaemon/mvnd"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# JavaScript package manager
brew "yarn"
# Zeebe CLI client
brew "zbctl"
# UNIX shell (command interpreter)
brew "zsh"
# Maven Daemon
brew "mvndaemon/mvnd/mvnd"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# Workflow and Decision Automation Platform
cask "camunda-modeler"
# App to build and share containerized applications and microservices
cask "docker"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Client for Old School RuneScape
cask "runelite"
# System monitor for the menu bar
cask "stats"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
