tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mhaeuser/mhaeuser"
tap "mvndaemon/mvnd"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Ammonite is a cleanroom re-implementation of the Scala REPL
brew "ammonite-repl"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# New way of working with Protocol Buffers
brew "buf"
# Statistics utility to count lines of code
brew "cloc"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Rebase alternative for easy & efficient in-memory rebases and fixups
brew "git-revise"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Bare libuv bindings for lua
brew "luv"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Theme for zsh
brew "powerlevel10k"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# JVM-based programming language
brew "scala"
# JVM-based programming language
brew "scala@2.13"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Simple GTD-style task management for the command-line
brew "ultralist"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Zeebe CLI client
brew "zbctl"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# UNIX shell (command interpreter)
brew "zsh"
# Apache Maven Daemon
brew "mvndaemon/mvnd/mvnd"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# Workflow and Decision Automation Platform
cask "camunda-modeler"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Launcher for *Epic Games* games
cask "epic-games"
cask "font-hack-nerd-font"
# Complete development tool for making 2D games
cask "gamemaker"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free and open-source image editor
cask "gimp"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tools to manage, monitor, profile and troubleshoot Java applications
cask "jdk-mission-control"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# End-to-end encryption software
cask "keybase"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Screen and video recording software
cask "loom"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cross-platform video editor
cask "openshot-video-editor"
# Monitors computer mic and webcam
cask "oversight"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Client for Old School RuneScape
cask "runelite"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Backup, recovery and cloning software
cask "superduper"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Stopwatch, alarm clock, and clock utility
cask "timer"
# To-do list
cask "todoist-app"
# Pomodoro desktop timer
cask "tomighty"
# Companion app for the Trezor hardware wallet
cask "trezor-suite"
# SSH server for teams managing distributed infrastructure
cask "tsh"
# Mutes your keyboard while you type
cask "unclack"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "timonwong.shellcheck"
